a52dec
abseil-cpp
acl
acpi
acpid
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
alacritty
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
amd-ucode
aom
appstream
apr
apr-util
arch-install-scripts
archlinux-keyring
argon2
aribb24
at-spi2-core
attica5
attr
audit
autoconf
automake
avahi
baloo-widgets
baloo5
base
base-devel
bash
binutils
bison
bluez
bluez-libs
boost-libs
brave-bin
breezy
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cantarell-fonts
cargo-audit
cbindgen
cdparanoia
cifs-utils
clang
compiler-rt
confuse
convertlit
coreutils
cryptsetup
curl
cxxbridge
dav1d
db
db5.3
dbus
dbus-glib
dbus-python
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
devtools
dhcpcd
diffutils
dnssec-anchors
dolphin
double-conversion
dpkg
duktape
e2fsprogs
ebook-tools
efibootmgr
efivar
electron
electron25
ell
exiv2
expat
faad2
fakeroot
feh
ffmpeg
ffmpeg4.4
fftw
file
filesystem
findutils
firewalld
flac
flex
fontconfig
freetype2
fribidi
fuse-common
fuse3
gawk
gc
gcc
gcc-libs
gcr
gdb
gdb-common
gdbm
gdk-pixbuf2
geoclue
gettext
giflib
git
glib-networking
glib2
glibc
glslang
gmp
gn
gnome-autoar
gnome-desktop-4
gnome-desktop-common
gnu-free-fonts
gnupg
gnutls
go
gobject-introspection-runtime
gperf
gperftools
gpgme
gpm
graphene
graphite
grep
groff
grub
gsettings-desktop-schemas
gsm
gssdp
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtk-update-icon-cache
gtk3
gtk4
guile
gupnp
gupnp-igd
gvfs
gzip
harfbuzz
harfbuzz-icu
hdparm
hicolor-icon-theme
hidapi
highway
htop
http-parser
hwdata
hwloc
i3-wm
i3blocks
i3lock
i3status
iana-etc
icu
imath
imlib2
inetutils
inxi
iproute2
iptables
iputils
iso-codes
iw
iwd
jack2
jansson
java-environment-common
java-runtime-common
jbigkit
jdk-openjdk
jq
json-c
json-glib
jsoncpp
kactivities5
karchive5
kauth5
kbd
kbookmarks5
kcmutils5
kcodecs5
kcompletion5
kconfig5
kconfigwidgets5
kcoreaddons5
kcrash5
kdbusaddons5
kdeclarative5
kded5
kdnssd5
kdsoap-qt5
keyutils
kfilemetadata5
kglobalaccel5
kguiaddons5
ki18n5
kiconthemes5
kidletime5
kio-extras
kio5
kitemviews5
kjobwidgets5
kmod
knewstuff5
knotifications5
kpackage5
kparts5
krb5
kservice5
ktextwidgets5
kuserfeedback5
kwallet5
kwidgetsaddons5
kwindowsystem5
kxmlgui5
l-smash
lame
lcms2
ldb
ldns
less
libadwaita
libaio
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libblockdev
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libconfig
libcups
libdaemon
libdatrie
libdbusmenu-qt5
libdca
libdeflate
libdovi
libdrm
libdvbpsi
libebml
libedit
libelf
libepoxy
libev
libevdev
libevent
libexif
libffi
libfontenc
libgcrypt
libgexiv2
libgirepository
libglvnd
libgpg-error
libgudev
libical
libice
libidn
libidn2
libiec61883
libimobiledevice
libinih
libinput
libisl
libjpeg-turbo
libjxl
libkexiv2
libksba
libldap
libmad
libmatroska
libmd
libmfx
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpeg2
libmtp
libnautilus-extension
libnet
libnetfilter_conntrack
libnfnetlink
libnftnl
libnghttp2
libnice
libnl
libnotify
libnsl
libnvme
libogg
libomxil-bellagio
libopenmpt
libp11-kit
libpcap
libpciaccess
libpipeline
libpipewire
libplacebo
libplist
libpng
libportal
libportal-gtk4
libproxy
libpsl
libptytty
libpulse
libraw1394
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libsm
libsndfile
libsoup3
libsoxr
libssh
libssh2
libstemmer
libsysprof-capture
libtar
libtasn1
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunibreak
libunistring
libunwind
libupnp
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libverto
libvorbis
libvpx
libwacom
libwbclient
libwebp
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpm
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libzip
licenses
light
linux
linux-api-headers
linux-firmware
linux-firmware-marvell
linux-firmware-whence
lld
llvm
llvm-libs
lm_sensors
lmdb
lsof
lua
luit
lvm2
lz4
lzo
m4
make
man-db
md4c
mdadm
media-player-info
mercurial
mesa
minizip
mkinitcpio
mkinitcpio-busybox
mpdecimal
mpfr
mpg123
mtdev
nautilus
ncurses
neofetch
net-tools
nettle
nftables
ninja
nmap
node-gyp
nodejs
nodejs-nopt
npm
npth
nspr
nss
ocl-icd
onevpl
oniguruma
openal
opencore-amr
openexr
openjpeg2
openmpi
openpmix
openssh
openssl
openssl-1.1
opus
orc
p11-kit
pacman
pacman-mirrorlist
pam
pambase
pango
parallel
parted
patch
pciutils
pcre
pcre2
perl
perl-error
perl-mailtools
perl-timedate
phonon-qt5
phonon-qt5-gstreamer
picom
pinentry
pipewire
pixman
pkgconf
polkit
polkit-qt5
poppler
poppler-qt5
popt
portaudio
procps-ng
psmisc
pulseaudio
pulseaudio-alsa
python
python-attrs
python-capng
python-cffi
python-charset-normalizer
python-configobj
python-cryptography
python-dulwich
python-fastbencode
python-gobject
python-gpgme
python-httplib2
python-idna
python-merge3
python-packaging
python-patiencediff
python-pip
python-ply
python-pycparser
python-pyparsing
python-pyqt5
python-pyqt5-sip
python-pysocks
python-requests
python-six
python-urllib3
python-wheel
python-yaml
qca-qt5
qt5-base
qt5-declarative
qt5-multimedia
qt5-speech
qt5-svg
qt5-translations
qt5-wayland
qt5-x11extras
rav1e
re2
readline
rofi
rpmextract
rsync
rtkit
rubberband
rust
rxvt-unicode
rxvt-unicode-terminfo
sdl2
sed
semver
serf
shaderc
shadow
shared-mime-info
smbclient
snappy
sof-firmware
solid5
sonnet5
sound-theme-freedesktop
source-highlight
speex
speexdsp
spirv-tools
sqlite
srt
startup-notification
subversion
sudo
svt-av1
syndication5
syntax-highlighting5
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tcl
tdb
tevent
texinfo
thin-provisioning-tools
tk
tlp
tor
torbrowser-launcher
tpm2-tss
tracker3
tree
tslib
ttf-liberation
ttf-roboto-mono
tzdata
udisks2
upower
usbmuxd
usbutils
util-linux
util-linux-libs
v4l-utils
vi
vid.stab
vim
vim-runtime
visual-studio-code-bin
vlc
vmaf
volume_key
vscodium-bin
vulkan-icd-loader
vulkan-radeon
wayland
webrtc-audio-processing
wget
which
woff2
x264
x265
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-desktop-portal
xdg-utils
xf86-input-libinput
xf86-video-amdgpu
xkeyboard-config
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-server-xvfb
xorg-setxkbmap
xorg-xauth
xorg-xev
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorgproto
xterm
xvidcore
xxhash
xz
yajl
yarn
yay
zimg
zlib
zsh
zstd
